Revit 2027 API
ParameterTypeId.BendingDetailSegmentRepresentation Property
 "Representation"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId BendingDetailSegmentRepresentation { get; }
Public Shared ReadOnly Property BendingDetailSegmentRepresentation As ForgeTypeId
	Get
public:
static property ForgeTypeId^ BendingDetailSegmentRepresentation {
	ForgeTypeId^ get ();
}
static member BendingDetailSegmentRepresentation : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace